//SOFT25A JOB (CCMVS),STARNES,CLASS=B,MSGCLASS=X,NOTIFY=&SYSUID
//S1 EXEC PGM=LODCOMPR,PARM='FILES=3,LIST=ALL'
//*   FILES=1, 2, or 3
//*   LIST=ALL, EXCEPTIONS, or DUPS
//STEPLIB DD DSN=loadlib,DISP=SHR
//INPUT1   DD DSN=file1,DISP=SHR
//INPUT2   DD DSN=file2,DISP=SHR
//INPUT3   DD DSN=file3,DISP=SHR
//SYSPRINT DD SYSOUT=*,DCB=RECFM=FA
//SYSUDUMP DD SYSOUT=*
